#include  <stdio.h>

int main(void) {
    printf("START");
    printf("\b\b\b\b\bSTOP \a\n");
    /* изначально в терминале должно появиться слово старт, потом переместив курсор влево 5 раз,
     * он становится в начале строки, и символы начинают перезаписываться: первые 4 символа на stop,
     * последний на пробел (в терминале clion последний символ заменяется на символ \a,
     * в обычном терминале остается т, поэтому нужно писать пробел)
     *
     * \а работает (звук) только при запуске через убунточный терминал */
    return 0;
}